{
  "format": "VCED",
  "parameters": [
    {
      "key": "R1",
      "short": "R1",
      "long": "Envelope Generator Rate 1",
      "min": 0,
      "max": 99,
      "description": "Envelope Generator (EG) rate for stage 1. Controls how quickly the envelope moves from Level 1 to Level 2 after a note is pressed.",
      "long_description": "Envelope Generator Rate 1 sets the initial attack rate of the Envelope Generator (EG) for an operator. When a key is pressed, the output level of the operator rises from its initial value (Envelope Generator Level 1) toward the next level (Envelope Generator Level 2) at a speed determined by Envelope Generator Rate 1. A higher Envelope Generator Rate 1 value results in a faster attack, producing a more percussive or immediate onset of sound. Lower values create a slower, more gradual attack. This parameter is crucial for shaping the character of the sound's beginning, from sharp plucks to soft fades. (Envelope Generator = EG)",
      "sound_impact": "A higher value makes the sound start more quickly, like a piano or xylophone note. A lower value makes the sound fade in more slowly, like a bowed string or a soft pad. This controls how sudden or gentle the beginning of each note feels. (A staccato note is short and detached; a legato note is smooth and connected.) When used in a modulator, a higher value causes the timbre to change more quickly at the start of the note, making the sound brighter or more metallic at the onset; a lower value makes the timbre evolve more slowly, resulting in a softer or more muted attack.",
      "parameter_number": 0,
      "massey_chapter": 9,
      "massey_subchapter": "Envelope Generators",
      "massey_chapter_name": "Envelope Generators"
    },
    {
      "key": "R2",
      "short": "R2",
      "long": "Envelope Generator Rate 2",
      "min": 0,
      "max": 99,
      "description": "Envelope Generator (EG) rate for stage 2. Controls how quickly the envelope moves from Level 2 to Level 3.",
      "long_description": "Envelope Generator Rate 2 determines the rate at which the Envelope Generator (EG) transitions from Envelope Generator Level 2 to Envelope Generator Level 3 after the initial attack. This stage is often used to create the decay portion of a sound, such as the drop in volume after a piano key is struck. A high Envelope Generator Rate 2 value causes a rapid decay, while a lower value results in a more sustained, gradual drop. This parameter is essential for controlling the dynamic contour of the sound after its initial onset. (Envelope Generator = EG)",
      "sound_impact": "A higher value makes the sound drop in volume quickly after the attack, like a plucked string. A lower value makes the sound hold its volume longer before fading, like a sustained organ or pad. This shapes how quickly the sound softens after the initial hit. When used in a modulator, a higher value causes the timbre to change rapidly after the attack, often making the sound become duller or less complex more quickly; a lower value keeps the timbre brighter or more harmonically rich for longer.",
      "parameter_number": 1,
      "massey_chapter": 9,
      "massey_subchapter": "Envelope Generators",
      "massey_chapter_name": "Envelope Generators"
    },
    {
      "key": "R3",
      "short": "R3",
      "long": "Envelope Generator Rate 3",
      "min": 0,
      "max": 99,
      "description": "Envelope Generator (EG) rate for stage 3. Controls how quickly the envelope moves from Level 3 to Level 4.",
      "long_description": "Envelope Generator Rate 3 sets the rate at which the Envelope Generator (EG) moves from Envelope Generator Level 3 to Envelope Generator Level 4. This stage typically represents the transition from the sustain phase to the release phase, or a further decay if the key is still held. Adjusting Envelope Generator Rate 3 allows for fine control over how the sound evolves while the note is sustained, influencing the perceived body and tail of the sound.",
      "sound_impact": "A higher value makes the sound's sustain phase shorter, quickly transitioning to a softer sound. A lower value prolongs the sustain, making the sound linger at a constant level before fading. This controls how the sound evolves while a note is held. When used in a modulator, a higher value causes the timbre to become simpler or less bright more quickly during the sustain, while a lower value keeps the timbre more complex or brighter for a longer time.",
      "parameter_number": 2,
      "massey_chapter": 9,
      "massey_subchapter": "Envelope Generators",
      "massey_chapter_name": "Envelope Generators"
    },
    {
      "key": "R4",
      "short": "R4",
      "long": "Envelope Generator Rate 4",
      "min": 0,
      "max": 99,
      "description": "Envelope Generator (EG) rate for stage 4. Controls how quickly the envelope moves from Level 4 to zero after a key is released (release time).",
      "long_description": "Envelope Generator Rate 4 controls the release rate of the Envelope Generator (EG) after a key is released. It determines how quickly the sound fades to silence. A high Envelope Generator Rate 4 value produces a quick release, making the sound stop almost immediately, while a low value allows the sound to linger and fade out slowly. This parameter is vital for shaping the naturalness and expressiveness of the sound's ending.",
      "sound_impact": "A higher value makes the sound cut off sharply when a key is released, like a staccato note. A lower value makes the sound fade out more gradually, like a legato passage. This affects how the end of each note is articulated. When used in a modulator, a higher value causes the timbre to become simpler or less bright very quickly after key release, while a lower value allows the timbre to fade out more gradually, often resulting in a more natural release.",
      "parameter_number": 3,
      "massey_chapter": 9,
      "massey_subchapter": "Envelope Generators",
      "massey_chapter_name": "Envelope Generators"
    },
    {
      "key": "L1",
      "short": "L1",
      "long": "Envelope Generator Level 1",
      "min": 0,
      "max": 99,
      "description": "Envelope Generator (EG) level for stage 1. The starting level when a note is pressed (usually maximum).",
      "long_description": "Envelope Generator Level 1 sets the initial level of the Envelope Generator (EG) when a note is played. It determines the starting volume of the sound. A higher Envelope Generator Level 1 value means a louder start, while a lower value results in a softer beginning. This parameter is important for defining the initial impact of the sound.",
      "sound_impact": "A higher value makes the sound start at a louder volume, giving it more presence and impact. A lower value makes the sound begin more quietly, which can be useful for subtle or distant effects. This controls the initial loudness of each note. When used in a modulator, a higher value makes the sound brighter or more harmonically rich at the very start of the note, while a lower value makes the initial timbre softer or more mellow.",
      "parameter_number": 4,
      "massey_chapter": 9,
      "massey_subchapter": "Envelope Generators",
      "massey_chapter_name": "Envelope Generators"
    },
    {
      "key": "L2",
      "short": "L2",
      "long": "Envelope Generator Level 2",
      "min": 0,
      "max": 99,
      "description": "Envelope Generator (EG) level for stage 2. The target level after the first decay stage.",
      "long_description": "Envelope Generator Level 2 sets the level that the Envelope Generator (EG) aims for after the initial decay. It defines the volume of the sound after the attack phase and during the decay phase. This parameter, in conjunction with Envelope Generator Rate 2, shapes how the sound evolves in its early stages.",
      "sound_impact": "A higher value sets a louder target level after the initial attack, making the sound fuller in the decay phase. A lower value reduces the level, creating a more pronounced drop in volume. This shapes the dynamic contour of the sound. When used in a modulator, a higher value keeps the timbre brighter or more complex after the attack, while a lower value makes the timbre become simpler or duller more quickly.",
      "parameter_number": 5,
      "massey_chapter": 9,
      "massey_subchapter": "Envelope Generators",
      "massey_chapter_name": "Envelope Generators"
    },
    {
      "key": "L3",
      "short": "L3",
      "long": "Envelope Generator Level 3",
      "min": 0,
      "max": 99,
      "description": "Envelope Generator (EG) level for stage 3. The sustain level while the key is held.",
      "long_description": "Envelope Generator Level 3 determines the sustain level of the Envelope Generator (EG) while a key is held down. It sets the volume of the sound during the sustain phase, following the decay. This level remains constant as long as the key is pressed and the envelope is in the sustain phase.",
      "sound_impact": "A higher value maintains a louder volume while the note is sustained, making the sound more powerful and present. A lower value reduces the sustain level, which can create a thinner or more delicate sound. This controls the body of the sound while a note is held. When used in a modulator, a higher value keeps the timbre bright and harmonically rich during the sustain, while a lower value makes the sustained timbre simpler or more mellow.",
      "parameter_number": 6,
      "massey_chapter": 9,
      "massey_subchapter": "Envelope Generators",
      "massey_chapter_name": "Envelope Generators"
    },
    {
      "key": "L4",
      "short": "L4",
      "long": "Envelope Generator Level 4",
      "min": 0,
      "max": 99,
      "description": "Envelope Generator (EG) level for stage 4. The final level after the key is released (usually zero).",
      "long_description": "Envelope Generator Level 4 sets the final level of the Envelope Generator (EG) after the key is released. It determines the volume of the sound at the end of the release phase. A higher Envelope Generator Level 4 value means the sound will fade out to a higher level, while a lower value will cause it to fade out to silence. This parameter is important for defining the tail end of the sound.",
      "sound_impact": "A higher value makes the sound end at a higher volume, which can create a lingering, resonant effect. A lower value makes the sound fade out to silence, which can be more abrupt. This shapes the final decay of the sound. When used in a modulator, a higher value keeps the timbre brighter or more complex at the end of the note, while a lower value makes the sound end with a simpler or duller timbre.",
      "parameter_number": 7,
      "massey_chapter": 9,
      "massey_subchapter": "Envelope Generators",
      "massey_chapter_name": "Envelope Generators"
    },
    {
      "key": "BP",
      "short": "BP",
      "long": "Keyboard Scaling Break Point",
      "min": 0,
      "max": 99,
      "description": "Keyboard scaling break point. The key at which left and right scaling curves meet. Determines where the keyboard scaling changes from left to right depth.",
      "long_description": "Keyboard Scaling Break Point sets the break point for keyboard scaling. It determines the key at which the scaling curves for the left and right sides of the keyboard intersect. This parameter is crucial for defining how the sound responds to key presses across the keyboard range, allowing for expressive playing dynamics.",
      "sound_impact": "This parameter doesn't have a direct sound impact by itself, but it defines the region on the keyboard where the scaling of other parameters changes. It affects how notes are voiced differently above and below this point, influencing the overall tonal balance.",
      "parameter_number": 8,
      "massey_chapter": 12,
      "massey_subchapter": "Keyboard Level Scaling",
      "massey_chapter_name": "Keyboard Level Scaling"
    },
    {
      "key": "LD",
      "short": "LD",
      "long": "Keyboard Scaling Left Depth",
      "min": 0,
      "max": 99,
      "description": "Keyboard scaling left depth. Amount of level scaling applied to notes to the left of the break point (lower notes).",
      "long_description": "Keyboard Scaling Left Depth controls the depth of scaling applied to notes on the left side of the break point. It affects how much the level of the sound is altered for lower notes. This parameter is important for shaping the tonal balance and dynamic response of the instrument across different registers.",
      "sound_impact": "A higher value increases the volume of lower notes more, making them sound fuller and more powerful. A lower value reduces this effect, which can make lower notes sound thinner. This shapes the tonal balance between the lower and higher notes.",
      "parameter_number": 9,
      "massey_chapter": 12,
      "massey_subchapter": "Keyboard Level Scaling",
      "massey_chapter_name": "Keyboard Level Scaling"
    },
    {
      "key": "RD",
      "short": "RD",
      "long": "Keyboard Scaling Right Depth",
      "min": 0,
      "max": 99,
      "description": "Keyboard scaling right depth. Amount of level scaling applied to notes to the right of the break point (higher notes).",
      "long_description": "Keyboard Scaling Right Depth controls the depth of scaling applied to notes on the right side of the break point. It affects how much the level of the sound is altered for higher notes. This parameter, along with Keyboard Scaling Left Depth, shapes the overall response of the instrument to key velocity and position.",
      "sound_impact": "A higher value increases the volume of higher notes more, making them sound brighter and more present. A lower value decreases this effect, which can make higher notes sound more subdued. This balances the response of the instrument across its range.",
      "parameter_number": 10,
      "massey_chapter": 12,
      "massey_subchapter": "Keyboard Level Scaling",
      "massey_chapter_name": "Keyboard Level Scaling"
    },
    {
      "key": "LC",
      "short": "LC",
      "long": "Keyboard Scaling Left Curve",
      "min": 0,
      "max": 3,
      "values": {
        "0": "+LIN",
        "1": "-EXP",
        "2": "+EXP",
        "3": "-LIN"
      },
      "description": "Keyboard scaling left curve. Determines the shape of the scaling curve to the left of the break point. +LIN: positive linear, -EXP: negative exponential, +EXP: positive exponential, -LIN: negative linear.",
      "long_description": "Keyboard Scaling Left Curve selects the curve type for the scaling applied to notes on the left side of the break point. The curve type determines how the scaling depth changes in relation to the distance from the break point. This parameter allows for detailed shaping of the instrument's response and tonal characteristics.",
      "sound_impact": "This parameter changes the way lower notes are scaled. For example, +LIN makes the scaling increase in a straight line, -EXP makes it increase quickly at first then slower, +EXP the opposite, and -LIN decreases the scaling in a straight line. It shapes the dynamic response of the instrument.",
      "parameter_number": 11,
      "massey_chapter": 12,
      "massey_subchapter": "Keyboard Level Scaling",
      "massey_chapter_name": "Keyboard Level Scaling"
    },
    {
      "key": "RC",
      "short": "RC",
      "long": "Keyboard Scaling Right Curve",
      "min": 0,
      "max": 3,
      "values": {
        "0": "+LIN",
        "1": "-EXP",
        "2": "+EXP",
        "3": "-LIN"
      },
      "description": "Keyboard scaling right curve. Determines the shape of the scaling curve to the right of the break point. +LIN: positive linear, -EXP: negative exponential, +EXP: positive exponential, -LIN: negative linear.",
      "long_description": "Keyboard Scaling Right Curve selects the curve type for the scaling applied to notes on the right side of the break point. Like Keyboard Scaling Left Curve, it determines how the scaling depth changes in relation to the distance from the break point, but for higher notes. This parameter is essential for achieving a balanced and expressive response across the entire keyboard.",
      "sound_impact": "This parameter changes the way higher notes are scaled, similar to the left curve. It defines whether the scaling increases or decreases in a linear or exponential manner. This shapes the dynamic response and tonal balance of the instrument.",
      "parameter_number": 12,
      "massey_chapter": 12,
      "massey_subchapter": "Keyboard Level Scaling",
      "massey_chapter_name": "Keyboard Level Scaling"
    },
    {
      "key": "RS",
      "short": "RS",
      "long": "Rate Scaling",
      "min": 0,
      "max": 7,
      "description": "Rate Scaling (RS). Amount by which envelope rates increase for higher notes. Higher values make higher notes have faster envelopes.",
      "long_description": "Rate Scaling adjusts the scaling of the envelope rates (R1, R2, R3, R4) for higher notes. It determines how much faster the envelope will reach its target levels for notes played above the break point. This parameter is important for ensuring consistent envelope timing and character across the keyboard range, especially in dynamic performances.",
      "sound_impact": "A higher value makes the envelopes of higher notes respond more quickly, which can add brightness and liveliness. A lower value means higher notes will have a slower envelope response, which can make them sound more subdued. This affects the expressiveness of notes played at different pitches.",
      "parameter_number": 13,
      "massey_chapter": 11,
      "massey_subchapter": "Keyboard velocity sensitivity",
      "massey_chapter_name": "EG Bias Modulation and Keyboard Bias Sensitivity"
    },
    {
      "key": "AMS",
      "short": "AMS",
      "long": "Amplitude Modulation Sensitivity",
      "min": 0,
      "max": 3,
      "description": "Amplitude Modulation Sensitivity (AMS). Sensitivity of the operator to amplitude modulation from the LFO (Low Frequency Oscillator).",
      "long_description": "Amplitude Modulation Sensitivity controls how much the amplitude of the operator is affected by modulation from the Low Frequency Oscillator (LFO). It determines the depth of tremolo or amplitude modulation applied to the sound. This parameter is key for adding expressiveness and movement to the sound through modulation effects.",
      "sound_impact": "A higher value makes the tremolo effect (rapid, regular changes in volume) more pronounced, adding expressiveness and depth to the sound. A lower value reduces the effect, which can make the sound more stable and less animated. This controls the sensitivity of the sound to modulation effects.",
      "parameter_number": 14,
      "massey_chapter": 10,
      "massey_subchapter": "Amplitude Modulation Sensitivity",
      "massey_chapter_name": "The LFO"
    },
    {
      "key": "TS",
      "short": "TS",
      "long": "Touch Sensitivity",
      "min": 0,
      "max": 7,
      "description": "Touch Sensitivity (TS). How much keyboard velocity (how hard you play) affects the operator's output level.",
      "long_description": "Touch Sensitivity adjusts the sensitivity of the operator's output level to the velocity of key presses. It determines how much the volume and possibly other parameters change in response to playing dynamics. This parameter is crucial for expressive playing, allowing the performer to control the sound's character and intensity through touch.",
      "sound_impact": "A higher value makes the sound respond more to how hard you play, adding dynamics and expression. A lower value means the sound will be less affected by playing strength, which can make it sound more uniform. This adjusts the instrument's responsiveness to the performer's touch.",
      "parameter_number": 15,
      "massey_chapter": 11,
      "massey_subchapter": "Keyboard velocity sensitivity",
      "massey_chapter_name": "EG Bias Modulation and Keyboard Bias Sensitivity"
    },
    {
      "key": "TL",
      "short": "TL",
      "long": "Total Level",
      "min": 0,
      "max": 99,
      "description": "Total Level (TL). Overall output level for the operator. Higher values reduce the output (acts as an attenuator).",
      "long_description": "Total Level sets the overall output level of the operator. It acts as a master volume control for the sound produced by the operator. This parameter is important for balancing the levels of different operators and shaping the final output level of the sound.",
      "sound_impact": "A higher value makes the overall sound louder, giving it more presence in the mix. A lower value reduces the volume, which can be useful for balancing with other sounds. This controls the final output level of the sound. When used in a modulator, a higher value makes the sound brighter and more harmonically rich, while a lower value makes the sound duller or more mellow.",
      "parameter_number": 16,
      "massey_chapter": 5,
      "massey_subchapter": "The Carrier",
      "massey_chapter_name": "The Carrier"
    },
    {
      "key": "PM",
      "short": "PM",
      "long": "Frequency Mode",
      "min": 0,
      "max": 1,
      "values": {
        "0": "Ratio",
        "1": "Fixed"
      },
      "description": "Frequency Mode (PM). Selects between frequency ratio mode (0: Ratio, operator frequency is a multiple of the base frequency) and fixed frequency mode (1: Fixed, operator frequency is set in Hz).",
      "long_description": "Frequency Mode selects the mode of frequency operation for the operator. In Ratio mode, the frequency of the operator is a fixed multiple of the base frequency, allowing for harmonic and inharmonic spectra. In Fixed mode, the operator's frequency is set directly, independent of the base frequency. This parameter is essential for defining the pitch and harmonic content of the sound.",
      "sound_impact": "Choosing 'Ratio' makes the pitch of the sound depend on the base frequency, which can create harmonically related sounds. 'Fixed' sets the pitch independently, allowing for exact tuning. This affects the basic pitch structure of the sound.",
      "parameter_number": 17,
      "massey_chapter": 5,
      "massey_subchapter": "The Carrier",
      "massey_chapter_name": "The Carrier"
    },
    {
      "key": "PC",
      "short": "PC",
      "long": "Frequency Coarse",
      "min": 0,
      "max": 31,
      "description": "Frequency Coarse (PC). Sets the coarse frequency multiplier for the operator (used in ratio mode).",
      "long_description": "Frequency Coarse adjusts the coarse frequency setting for the operator when in Ratio mode. It determines the integer multiple of the base frequency that the operator will produce. This parameter is important for coarsely tuning the pitch of the operator and for defining the harmonic relationships between operators.",
      "sound_impact": "This parameter sets the basic pitch range of the operator in Ratio mode. It affects the harmonic content and how the operator interacts with others in terms of pitch. This is crucial for tuning and creating intervals between sounds.",
      "parameter_number": 18,
      "massey_chapter": 5,
      "massey_subchapter": "The Carrier",
      "massey_chapter_name": "The Carrier"
    },
    {
      "key": "PF",
      "short": "PF",
      "long": "Frequency Fine",
      "min": 0,
      "max": 99,
      "description": "Frequency Fine (PF). Fine-tunes the operator frequency (used in ratio mode).",
      "long_description": "Frequency Fine provides fine-tuning adjustments to the operator's frequency in Ratio mode. It allows for precise control over the pitch, enabling the creation of exact intervals and harmonies. This parameter is crucial for detailed tuning and for achieving specific musical intervals and microtonal adjustments.",
      "sound_impact": "This parameter allows for precise pitch adjustments, enabling exact tuning of intervals and harmonies. It is essential for achieving the desired pitch relationships between sounds, especially in complex musical passages.",
      "parameter_number": 19,
      "massey_chapter": 5,
      "massey_subchapter": "The Carrier",
      "massey_chapter_name": "The Carrier"
    },
    {
      "key": "PD",
      "short": "PD",
      "long": "Detune",
      "min": 0,
      "max": 14,
      "center": 7,
      "description": "Detune (PD). Detunes the operator up or down in small increments. 7 is center (no detune), lower values are negative, higher values are positive.",
      "long_description": "Detune adjusts the detuning of the operator's frequency, allowing it to be slightly sharp or flat relative to the base pitch. This parameter is useful for creating beats, enhancing harmonics, and achieving a desired tuning character. The center value of 7 represents no detuning, with values below 7 applying negative detune (lowering the pitch) and values above 7 applying positive detune (raising the pitch).",
      "sound_impact": "Detuning slightly alters the pitch, which can create a thicker, more complex sound due to the interaction of slightly out-of-tune frequencies. It is useful for subtle tuning adjustments and for creating specific harmonic effects. When used in a modulator, detune can add movement and animation to the timbre, making the sound more lively or shimmering.",
      "parameter_number": 20,
      "massey_chapter": 5,
      "massey_subchapter": "The Carrier",
      "massey_chapter_name": "The Carrier"
    },
    {
      "key": "PR1",
      "short": "PR1",
      "long": "Pitch Envelope Generator Rate 1",
      "min": 0,
      "max": 99,
      "description": "Pitch Envelope Generator (PEG) rate for stage 1. Controls how quickly the pitch envelope moves from Level 1 to Level 2.",
      "long_description": "Pitch Envelope Generator Rate 1 sets the rate at which the Pitch Envelope Generator (PEG) moves from the initial pitch level (Pitch Envelope Generator Level 1) to the next level (Pitch Envelope Generator Level 2) after a note is played. A higher Pitch Envelope Generator Rate 1 value results in a faster pitch increase, creating a more pronounced pitch envelope effect. This parameter is important for shaping the pitch contour of the sound, especially in the initial stages of a note.",
      "sound_impact": "A higher value makes the pitch rise more quickly at the start, which can add a sense of urgency or impact. A lower value means the pitch will increase more slowly, which can create a more gradual, swelling effect. This shapes the initial pitch movement of the sound.",
      "parameter_number": 126,
      "massey_chapter": 15,
      "massey_subchapter": "Changing pitch",
      "massey_chapter_name": "Advanced Programming Techniques"
    },
    {
      "key": "PR2",
      "short": "PR2",
      "long": "Pitch Envelope Generator Rate 2",
      "min": 0,
      "max": 99,
      "description": "Pitch Envelope Generator (PEG) rate for stage 2. Controls how quickly the pitch envelope moves from Level 2 to Level 3.",
      "long_description": "Pitch Envelope Generator Rate 2 determines the rate of change for the pitch envelope from Level 2 to Level 3. It controls how quickly the pitch reaches its sustain level after the initial attack. This parameter, together with Pitch Envelope Generator Rate 1, shapes the early pitch dynamics and character of the sound.",
      "sound_impact": "A higher value makes the pitch drop to the sustain level more quickly, which can create a snappier, more defined pitch contour. A lower value results in a slower pitch transition, adding to a smoother, more connected sound.",
      "parameter_number": 127,
      "massey_chapter": 15,
      "massey_subchapter": "Changing pitch",
      "massey_chapter_name": "Advanced Programming Techniques"
    },
    {
      "key": "PR3",
      "short": "PR3",
      "long": "Pitch Envelope Generator Rate 3",
      "min": 0,
      "max": 99,
      "description": "Pitch Envelope Generator (PEG) rate for stage 3. Controls how quickly the pitch envelope moves from Level 3 to Level 4.",
      "long_description": "Pitch Envelope Generator Rate 3 sets the rate at which the pitch envelope moves from the sustain level (Pitch Envelope Generator Level 3) to the release level (Pitch Envelope Generator Level 4). This parameter is important for defining how the pitch evolves after the key is released, influencing the perceived length and character of the sound's pitch tail.",
      "sound_impact": "A higher value makes the pitch fall more quickly after the sustain, which can shorten the perceived length of the note and add a sense of clarity. A lower value allows the pitch to fall more gradually, which can make the note sound longer and more connected.",
      "parameter_number": 128,
      "massey_chapter": 15,
      "massey_subchapter": "Changing pitch",
      "massey_chapter_name": "Advanced Programming Techniques"
    },
    {
      "key": "PR4",
      "short": "PR4",
      "long": "Pitch Envelope Generator Rate 4",
      "min": 0,
      "max": 99,
      "description": "Pitch Envelope Generator (PEG) rate for stage 4. Controls how quickly the pitch envelope moves from Level 4 to zero after a key is released.",
      "long_description": "Pitch Envelope Generator Rate 4 controls the release rate of the Pitch Envelope Generator (PEG) after a key is released. It determines how quickly the pitch returns to its base value. A high Pitch Envelope Generator Rate 4 value results in a rapid pitch drop, while a low value allows for a more gradual return to the base pitch. This parameter is vital for shaping the naturalness and expressiveness of the sound's ending.",
      "sound_impact": "A higher value makes the pitch drop to the base value quickly, which can create a more abrupt and defined end to the note. A lower value results in a slower pitch return, allowing the note to fade out more smoothly.",
      "parameter_number": 129,
      "massey_chapter": 15,
      "massey_subchapter": "Changing pitch",
      "massey_chapter_name": "Advanced Programming Techniques"
    },
    {
      "key": "PL1",
      "short": "PL1",
      "long": "Pitch Envelope Generator Level 1",
      "min": 0,
      "max": 99,
      "description": "Pitch Envelope Generator (PEG) level for stage 1. The starting pitch level when a note is pressed.",
      "long_description": "Pitch Envelope Generator Level 1 sets the initial pitch level of the Pitch Envelope Generator (PEG) when a note is played. It determines the starting frequency of the sound. A higher Pitch Envelope Generator Level 1 value means a higher starting pitch, while a lower value results in a lower starting pitch. This parameter is important for defining the initial pitch impact of the sound.",
      "sound_impact": "A higher value starts the sound at a higher pitch, which can make the note feel brighter and more immediate. A lower value starts at a lower pitch, which can create a more subdued or mellow beginning.",
      "parameter_number": 130,
      "massey_chapter": 15,
      "massey_subchapter": "Changing pitch",
      "massey_chapter_name": "Advanced Programming Techniques"
    },
    {
      "key": "PL2",
      "short": "PL2",
      "long": "Pitch Envelope Generator Level 2",
      "min": 0,
      "max": 99,
      "description": "Pitch Envelope Generator (PEG) level for stage 2. The target pitch level after the first decay stage.",
      "long_description": "Pitch Envelope Generator Level 2 sets the target pitch level that the Pitch Envelope Generator (PEG) aims for after the initial decay. It defines the pitch of the sound after the attack phase and during the decay phase. This parameter, in conjunction with Pitch Envelope Generator Rate 2, shapes how the pitch of the sound evolves in its early stages.",
      "sound_impact": "A higher value sets a higher target pitch after the initial drop, which can create a sense of lift or brightness. A lower value sets a lower target pitch, making the sound darker or more grounded.",
      "parameter_number": 131,
      "massey_chapter": 15,
      "massey_subchapter": "Changing pitch",
      "massey_chapter_name": "Advanced Programming Techniques"
    },
    {
      "key": "PL3",
      "short": "PL3",
      "long": "Pitch Envelope Generator Level 3",
      "min": 0,
      "max": 99,
      "description": "Pitch Envelope Generator (PEG) level for stage 3. The sustain pitch level while the key is held.",
      "long_description": "Pitch Envelope Generator Level 3 determines the sustain pitch level of the Pitch Envelope Generator (PEG) while a key is held down. It sets the pitch of the sound during the sustain phase, following the decay. This level remains constant as long as the key is pressed and the envelope is in the sustain phase.",
      "sound_impact": "A higher value keeps the pitch higher while the note is sustained, which can add brilliance and clarity. A lower value lowers the pitch, which can make the sound richer or more somber.",
      "parameter_number": 132,
      "massey_chapter": 15,
      "massey_subchapter": "Changing pitch",
      "massey_chapter_name": "Advanced Programming Techniques"
    },
    {
      "key": "PL4",
      "short": "PL4",
      "long": "Pitch Envelope Generator Level 4",
      "min": 0,
      "max": 99,
      "description": "Pitch Envelope Generator (PEG) level for stage 4. The final pitch level after the key is released.",
      "long_description": "Pitch Envelope Generator Level 4 sets the final pitch level of the Pitch Envelope Generator (PEG) after the key is released. It determines the pitch of the sound at the end of the release phase. A higher Pitch Envelope Generator Level 4 value means the sound will end at a higher pitch, while a lower value will cause it to end at a lower pitch. This parameter is important for defining the tail end of the sound's pitch contour.",
      "sound_impact": "A higher value ends the sound at a higher pitch, which can create a sense of lift or brightness at the end of the note. A lower value ends at a lower pitch, which can make the note feel more grounded or resolved.",
      "parameter_number": 133,
      "massey_chapter": 15,
      "massey_subchapter": "Changing pitch",
      "massey_chapter_name": "Advanced Programming Techniques"
    },
    {
      "key": "ALS",
      "short": "ALS",
      "long": "Algorithm Selector",
      "min": 0,
      "max": 31,
      "description": "Algorithm Selector (ALS). Selects the algorithm (operator routing configuration) for the voice. Each algorithm determines how operators modulate each other.",
      "long_description": "Algorithm Selector selects the algorithm for operator routing in the voice. The algorithm determines the signal flow and modulation relationships between the operators, shaping the overall sound generation process. Different algorithms can produce widely varying timbres and sonic characteristics.",
      "sound_impact": "This parameter selects the routing and modulation scheme for the operators, which fundamentally changes how the sound is generated and what harmonic content is produced. It can drastically alter the character of the sound.",
      "parameter_number": 134,
      "massey_chapter": 7,
      "massey_subchapter": "The algorithms",
      "massey_chapter_name": "Stacked Modulators and the Feedback Loop"
    },
    {
      "key": "FBL",
      "short": "FBL",
      "long": "Feedback Level",
      "min": 0,
      "max": 7,
      "description": "Feedback Level (FBL). Amount of feedback applied to the operator designated for feedback in the selected algorithm. Higher values increase the effect.",
      "long_description": "Feedback Level controls the amount of feedback applied to the operator designated for feedback in the selected algorithm. Feedback increases the intensity and can create resonant peaks in the sound spectrum. This parameter is essential for designing complex, evolving sounds and for adding richness and depth to the timbre.",
      "sound_impact": "Higher feedback levels can create a more resonant and intense sound, adding harmonics and complexity. Lower levels result in a cleaner sound with less harmonic interaction. This shapes the richness and depth of the timbre.",
      "parameter_number": 135,
      "massey_chapter": 7,
      "massey_subchapter": "The feedback loop",
      "massey_chapter_name": "Stacked Modulators and the Feedback Loop"
    },
    {
      "key": "OPI",
      "short": "OPI",
      "long": "Oscillator Phase Initialization",
      "min": 0,
      "max": 1,
      "values": {
        "0": "Off",
        "1": "On"
      },
      "description": "Oscillator Phase Initialization (OPI). If On, the oscillator phase is reset to zero each time a note is played, making the attack more consistent.",
      "long_description": "Oscillator Phase Initialization determines whether the oscillator phase is reset to zero with each note onset. When enabled, this feature ensures that the attack phase of the sound is consistent and repeatable, which is particularly useful for percussive sounds. When disabled, the oscillator phase continues from its last position, which can create a more fluid and evolving sound but may result in less consistent attacks.",
      "sound_impact": "When set to 'On', this parameter makes the start of each note more consistent, which is useful for rhythmic or percussive sounds. When 'Off', each note may start with a slightly different phase, adding variability and potentially a more fluid sound.",
      "parameter_number": 136,
      "massey_chapter": 5,
      "massey_subchapter": "Oscillator key sync",
      "massey_chapter_name": "The Carrier"
    },
    {
      "key": "LFS",
      "short": "LFS",
      "long": "Low Frequency Oscillator Speed",
      "min": 0,
      "max": 99,
      "description": "Low Frequency Oscillator (LFO) speed. Controls how fast the LFO cycles.",
      "long_description": "Low Frequency Oscillator Speed sets the speed of the Low Frequency Oscillator (LFO), which modulates various parameters at a low frequency. This parameter is crucial for defining the rate of modulation effects such as vibrato, tremolo, and filter modulation. A higher Low Frequency Oscillator Speed value results in a faster LFO cycle, producing quicker modulation effects.",
      "sound_impact": "A higher value makes the modulation effects happen more quickly, which can add a sense of speed and agility to the sound. A lower value slows down the effects, which can make the sound feel more languid or drawn out. This controls the rate of modulation effects.",
      "parameter_number": 137,
      "massey_chapter": 10,
      "massey_subchapter": "The LFO",
      "massey_chapter_name": "The LFO"
    },
    {
      "key": "LFD",
      "short": "LFD",
      "long": "Low Frequency Oscillator Delay Time",
      "min": 0,
      "max": 99,
      "description": "Low Frequency Oscillator (LFO) delay time. Sets how long after a note is played before the LFO effect begins.",
      "long_description": "Low Frequency Oscillator Delay Time controls the delay time before the Low Frequency Oscillator (LFO) starts affecting the sound after a note is played. It determines the latency of the modulation effects. This parameter is important for creating dynamic and expressive sounds, allowing the performer to control the onset of modulation effects relative to the note attack.",
      "sound_impact": "A higher value delays the onset of the modulation effects, which can create a more pronounced attack before the modulation begins. A lower value makes the modulation start sooner, which can make the sound feel more integrated and fluid.",
      "parameter_number": 138,
      "massey_chapter": 10,
      "massey_subchapter": "The LFO",
      "massey_chapter_name": "The LFO"
    },
    {
      "key": "LPMD",
      "short": "LPMD",
      "long": "LFO Pitch Modulation Depth",
      "min": 0,
      "max": 99,
      "description": "LFO Pitch Modulation Depth (LPMD). Controls how much the LFO modulates pitch (vibrato).",
      "long_description": "LFO Pitch Modulation Depth sets the depth of pitch modulation applied by the Low Frequency Oscillator (LFO). It controls the extent of the vibrato effect, determining how much the pitch fluctuates around the base pitch. This parameter is essential for adding expressiveness and character to the sound through pitch modulation.",
      "sound_impact": "A higher value increases the depth of the vibrato effect, making the pitch fluctuations more pronounced. A lower value reduces the vibrato depth, resulting in subtler pitch variations. This controls the expressiveness and character of the sound.",
      "parameter_number": 139,
      "massey_chapter": 10,
      "massey_subchapter": "The LFO",
      "massey_chapter_name": "The LFO"
    },
    {
      "key": "LAMD",
      "short": "LAMD",
      "long": "LFO Amplitude Modulation Depth",
      "min": 0,
      "max": 99,
      "description": "LFO Amplitude Modulation Depth (LAMD). Controls how much the LFO modulates amplitude (tremolo).",
      "long_description": "LFO Amplitude Modulation Depth controls the depth of amplitude modulation applied by the Low Frequency Oscillator (LFO). It determines the extent of the tremolo effect, shaping how the loudness of the sound fluctuates over time. This parameter is key for creating dynamic and expressive sounds with amplitude modulation.",
      "sound_impact": "A higher value makes the tremolo effect (rapid, regular changes in volume) deeper, causing more pronounced changes in volume. A lower value results in a shallower effect, with less variation in loudness. This shapes the dynamic character of the sound. (Tremolo is a musical effect where the volume rapidly fluctuates.)",
      "parameter_number": 140,
      "massey_chapter": 10,
      "massey_subchapter": "The LFO",
      "massey_chapter_name": "The LFO"
    },
    {
      "key": "LFKS",
      "short": "LFKS",
      "long": "LFO Key Sync",
      "min": 0,
      "max": 1,
      "values": {
        "0": "Off",
        "1": "On"
      },
      "description": "LFO Key Sync (LFKS). If On, the LFO restarts its cycle with each new note played.",
      "long_description": "LFO Key Sync determines whether the Low Frequency Oscillator (LFO) resets its cycle each time a note is played. When enabled, the LFO starts a new cycle with each key press, ensuring that the modulation effects are synchronized with the note onset. When disabled, the LFO continues its cycle independently of note triggering, which can create a more fluid and evolving sound texture.",
      "sound_impact": "When set to 'On', this parameter makes the modulation effects restart with each note, which can tighten the relationship between the notes and their effects. When 'Off', the effects may evolve independently of the note triggers, adding a layer of complexity and fluidity to the sound.",
      "parameter_number": 141,
      "massey_chapter": 10,
      "massey_subchapter": "The LFO",
      "massey_chapter_name": "The LFO"
    },
    {
      "key": "LFW",
      "short": "LFW",
      "long": "LFO Waveform",
      "min": 0,
      "max": 5,
      "values": {
        "0": "Sine",
        "1": "Triangle",
        "2": "Saw Down",
        "3": "Saw Up",
        "4": "Square",
        "5": "Sample & Hold"
      },
      "description": "LFO Waveform (LFW). Selects the shape of the LFO: Sine, Triangle, Saw Down, Saw Up, Square, or Sample & Hold.",
      "long_description": "LFO Waveform selects the waveform of the Low Frequency Oscillator (LFO), which determines the shape of the modulation signal. The selected waveform affects the character of the modulation effects, such as the smoothness of vibrato or the choppiness of tremolo. This parameter is essential for designing the timbre and movement of the sound.",
      "sound_impact": "This parameter changes the shape of the modulation signal. For example, 'Sine' produces a smooth, continuous wave, while 'Square' produces a wave that jumps abruptly between high and low. This affects the character and texture of the modulation effects.",
      "parameter_number": 142,
      "massey_chapter": 10,
      "massey_subchapter": "The LFO",
      "massey_chapter_name": "The LFO"
    },
    {
      "key": "LPMS",
      "short": "LPMS",
      "long": "LFO Pitch Modulation Sensitivity",
      "min": 0,
      "max": 7,
      "description": "LFO Pitch Modulation Sensitivity (LPMS). Sensitivity of pitch modulation to the LFO. Higher values increase the effect of the LFO on pitch.",
      "long_description": "LFO Pitch Modulation Sensitivity adjusts the sensitivity of the pitch modulation depth to the Low Frequency Oscillator (LFO). It determines how much the LFO's modulation affects the pitch of the sound. This parameter is important for scaling the pitch modulation effect to the desired level of expressiveness and intensity.",
      "sound_impact": "A higher value makes the pitch modulation more sensitive to the LFO, which can enhance the expressiveness and dynamic range of the pitch effects. A lower value reduces this sensitivity, leading to a more uniform pitch response.",
      "parameter_number": 143,
      "massey_chapter": 10,
      "massey_subchapter": "The LFO",
      "massey_chapter_name": "The LFO"
    },
    {
      "key": "TRNP",
      "short": "TRNP",
      "long": "Transpose",
      "min": 0,
      "max": 48,
      "description": "Transpose (TRNP). Transposes the voice up or down in semitones. 24 is no transpose, lower values transpose down, higher values transpose up (±2 octaves).",
      "long_description": "Transpose sets the transposition of the voice in semitones, allowing the entire range of the instrument to be shifted up or down in pitch. This parameter is useful for adapting the instrument to different musical contexts or for achieving specific tuning requirements. The transposition is applied uniformly across all notes, maintaining the relative pitch relationships.",
      "sound_impact": "This parameter shifts the pitch of the entire sound up or down, which can be used to match the sound to other instruments or to create specific musical effects. It transposes all notes equally, preserving their relative relationships.",
      "parameter_number": 144,
      "massey_chapter": 15,
      "massey_subchapter": "Changing pitch",
      "massey_chapter_name": "Advanced Programming Techniques"
    },
    {
      "key": "OPE",
      "short": "OPE",
      "long": "Operator Enable",
      "min": 0,
      "max": 1,
      "values": {
        "0": "Off",
        "1": "On"
      },
      "description": "Operator Enable (OPE). Turns the operator on or off. 0 = Off, 1 = On.",
      "long_description": "Operator Enable determines whether the operator is active or inactive in the sound generation process. When set to 'On', the operator contributes to the sound; when set to 'Off', it does not produce any sound. This parameter is essential for controlling which operators are used in a voice and for designing complex sounds with multiple operators.",
      "sound_impact": "This parameter turns the operator on or off. When 'On', the operator contributes to the sound; when 'Off', it does not produce any sound. This is crucial for controlling which operators are active in a voice and for designing complex sounds.",
      "parameter_number": 145,
      "massey_chapter": 5,
      "massey_subchapter": "The Carrier",
      "massey_chapter_name": "The Carrier"
    }
  ],
  "TX816Perf": [
    {
      "key": "SRC",
      "short": "SRC",
      "long": "Source Select (MIDI Channel)",
      "min": 1,
      "max": 16,
      "description": "Selects the MIDI channel (1-16) that this part responds to.",
      "parameter_number": 1
    },
    {
      "key": "PMO",
      "short": "PMO",
      "long": "Poly/Mono Mode",
      "min": 0,
      "max": 1,
      "values": {"0": "Polyphonic", "1": "Monophonic"},
      "description": "Poly/Mono mode: 0 = Polyphonic, 1 = Monophonic.",
      "parameter_number": 2
    },
    {
      "key": "PBR",
      "short": "PBR",
      "long": "Pitch Bend Range",
      "min": 0,
      "max": 12,
      "description": "Pitch Bend Range: Maximum range in semitones for pitch bend wheel.",
      "parameter_number": 3
    },
    {
      "key": "PBS",
      "short": "PBS",
      "long": "Pitch Bend Step",
      "min": 0,
      "max": 12,
      "description": "Pitch Bend Step: Step size in semitones for pitch bend.",
      "parameter_number": 4
    },
    {
      "key": "PRT",
      "short": "PRT",
      "long": "Portamento Time",
      "min": 0,
      "max": 99,
      "description": "Portamento Time: Time in ms to glide between notes.",
      "parameter_number": 5
    },
    {
      "key": "PGL",
      "short": "PGL",
      "long": "Portamento/Glissando",
      "min": 0,
      "max": 1,
      "values": {"0": "Portamento", "1": "Glissando"},
      "description": "Portamento/Glissando: 0 = Portamento, 1 = Glissando.",
      "parameter_number": 6
    },
    {
      "key": "PMD",
      "short": "PMD",
      "long": "Portamento Mode",
      "min": 0,
      "max": 1,
      "values": {"0": "Normal", "1": "Fingered"},
      "description": "Portamento Mode: 0 = Normal, 1 = Fingered.",
      "parameter_number": 7
    },
    {
      "key": "MWS",
      "short": "MWS",
      "long": "Mod Wheel Sensitivity",
      "min": 0,
      "max": 15,
      "description": "Modulation Wheel Sensitivity: Depth of modulation wheel effect.",
      "parameter_number": 9
    },
    {
      "key": "MWA",
      "short": "MWA",
      "long": "Mod Wheel Assign",
      "min": 0,
      "max": 7,
      "description": "Modulation Wheel Assign: Assigns modulation wheel to a function.",
      "parameter_number": 10
    },
    {
      "key": "FCS",
      "short": "FCS",
      "long": "Foot Ctrl Sensitivity",
      "min": 0,
      "max": 15,
      "description": "Foot Controller Sensitivity: Depth of foot controller effect.",
      "parameter_number": 11
    },
    {
      "key": "FCA",
      "short": "FCA",
      "long": "Foot Ctrl Assign",
      "min": 0,
      "max": 7,
      "description": "Foot Controller Assign: Assigns foot controller to a function.",
      "parameter_number": 12
    },
    {
      "key": "ATS",
      "short": "ATS",
      "long": "After Touch Sensitivity",
      "min": 0,
      "max": 15,
      "description": "After Touch Sensitivity: Depth of aftertouch effect.",
      "parameter_number": 13
    },
    {
      "key": "ATA",
      "short": "ATA",
      "long": "After Touch Assign",
      "min": 0,
      "max": 7,
      "description": "After Touch Assign: Assigns aftertouch to a function.",
      "parameter_number": 14
    },
    {
      "key": "BCS",
      "short": "BCS",
      "long": "Breath Ctrl Sensitivity",
      "min": 0,
      "max": 15,
      "description": "Breath Controller Sensitivity: Depth of breath controller effect.",
      "parameter_number": 15
    },
    {
      "key": "BCA",
      "short": "BCA",
      "long": "Breath Ctrl Assign",
      "min": 0,
      "max": 7,
      "description": "Breath Controller Assign: Assigns breath controller to a function.",
      "parameter_number": 16
    },
    {
      "key": "ATT",
      "short": "ATT",
      "long": "Audio Output Level Attenuator",
      "min": 0,
      "max": 7,
      "description": "Audio Output Level Attenuator: Reduces output level in steps.",
      "parameter_number": 26
    },
    {
      "key": "MTU",
      "short": "MTU",
      "long": "Master Tuning",
      "min": 0,
      "max": 127,
      "description": "Master Tuning: Fine-tunes the overall pitch (0-127).",
      "parameter_number": 64
    }
  ]
}
